{
  "items": [
    {
      "id": "appendix-a",
      "title": "Appendix A: Glossary of AI Terms for Designers",
      "content": "# **Appendix A: Glossary of AI Terms for Designers**\n\n- Algorithm: A step-by-step procedure for solving a problem or accomplishing a task.\n- Bias (in AI): Systematic errors in AI outputs that disadvantage certain groups, typically resulting from biased training data.\n- Context window: The amount of text an AI can consider at once when generating responses.\n- Deep learning: A subset of machine learning using neural networks with many layers.\n- Fine-tuning: Additional training on specific data to specialize a general-purpose model.\n- Generative AI: AI systems that generate new content (text, images, audio, code) rather than just analyzing existing content.\n- Hallucination: When an AI produces confident-sounding but incorrect or fabricated information.\n- Inference: Using a trained model to make predictions or generate outputs on new data.\n- Large Language Model (LLM): AI systems trained on massive text datasets to understand and generate natural language.\n- Machine learning (ML): AI systems that learn from data rather than being explicitly programmed.\n- Model: A trained AI system that can make predictions or generate outputs based on learned patterns.\n- Natural Language Processing (NLP): AI technology for understanding and generating human language.\n- Neural network: A computing system inspired by biological neural networks, the foundation of most modern AI.\n- Prompt: The input given to an AI system to guide its output.\n- Prompt engineering: The practice of crafting effective prompts to get better results from AI systems.\n- Reinforcement learning: Training AI through trial and error with rewards and penalties.\n- Supervised learning: Training AI with labeled examples where correct answers are known.\n- Temperature: A parameter controlling randomness in AI outputs-higher temperature means more varied results.\n- Token: A unit of text that LLMs process-roughly equivalent to a word or word piece.\n- Training: The process of teaching an AI system by exposing it to data.\n- Transformer: The neural network architecture underlying most modern LLMs.\n- Unsupervised learning: Training AI to find patterns in data without labeled examples.\n\n"
    },
    {
      "id": "appendix-b",
      "title": "Appendix B: Tool Comparison Matrix",
      "content": "# **Appendix B: Tool Comparison Matrix**\n\n## **Language Models**\n\nChatGPT (OpenAI): Strong general-purpose capabilities, code generation, plugin ecosystem. Good for brainstorming, writing, code help.\n\nClaude (Anthropic): Strong analysis and nuance, longer context window, thoughtful on sensitive topics. Good for research analysis, detailed writing.\n\nGemini (Google): Multimodal capabilities, Google integration. Good for tasks involving multiple content types.\n\n## **Image Generators**\n\nMidjourney: High aesthetic quality, strong for artistic and design imagery. Access via Discord. Good for moodboards, visual concepts.\n\nDALL-E: Good general-purpose generation, accessible via ChatGPT. Good for quick concept visualization.\n\nStable Diffusion: Open source, runs locally, highly customizable. Good for those wanting technical control.\n\n## **Design-Integrated AI**\n\nFigma AI: Built into Figma for design suggestions, auto-layout, and content generation.\n\nAdobe Firefly: Adobe's AI image generation integrated with Creative Cloud.\n\nVarious plugins: Numerous Figma, Sketch, and other plugins adding AI capabilities.\n\n## **Research and Analysis**\n\nVarious tools emerge regularly for research transcription, analysis, and synthesis. Evaluate current options against your specific needs.\n\n"
    },
    {
      "id": "appendix-c",
      "title": "Appendix C: Sample Prompts Library",
      "content": "# **Appendix C: Sample Prompts Library**\n\n## **Research Prompts**\n\n_'Summarize this user interview transcript, focusing on: main pain points, key feature requests, surprising insights, and notable quotes.'_\n\n_'Given these 10 interview summaries, identify the top 5 recurring themes across participants.'_\n\n_'Generate 10 interview questions to explore users' habits and frustrations with \\[product type\\].'_\n\n## **Ideation Prompts**\n\n_'Brainstorm 10 different approaches to solve \\[specific problem\\]. Make each approach distinctly different.'_\n\n_'What assumptions are we making about how users should complete \\[task\\]? For each, suggest alternatives.'_\n\n_'How do other industries solve the problem of \\[challenge\\]? Give examples from at least 3 different domains.'_\n\n## **Visual Design Prompts**\n\n_'\\[For Midjourney\\] Modern mobile app interface for \\[purpose\\], \\[style\\] aesthetic, \\[color description\\], \\[mood\\]'_\n\n_'\\[For Midjourney\\] Set of minimalist icons for \\[app type\\] including \\[icon list\\], consistent \\[style\\] style'_\n\n## **UX Writing Prompts**\n\n_'Suggest 5 different labels for a button that \\[action\\]. Tone should be \\[description\\].'_\n\n_'Write an error message for when \\[situation\\]. Should clearly explain problem and suggest next steps.'_\n\n_'Generate realistic placeholder content for \\[element type\\] including \\[variations needed\\].'_\n\n## **Code Generation Prompts**\n\n_'Generate HTML and CSS code that replicates this mobile app screen design. Use Tailwind CSS. Make responsive.'_\n\n_'Generate a React component based on these specifications: \\[specs\\]. Include all states and variations.'_\n\n## **Review Prompts**\n\n_'Review this design against Nielsen's 10 usability heuristics. For each, rate compliance and identify violations.'_\n\n_'Evaluate this design for accessibility: color contrast, text size, touch targets, screen reader compatibility.'_\n\n"
    },
    {
      "id": "appendix-d",
      "title": "Appendix D: Career Transition Checklist",
      "content": "# **Appendix D: Career Transition Checklist**\n\nUse this checklist to prepare for transitioning to an AI-enhanced UX role:\n\n## **Skills Development**\n\n- Achieved working proficiency with at least one major LLM (ChatGPT or Claude)\n- Experimented with at least one AI image generator (Midjourney, DALL-E, or similar)\n- Learned basic prompt engineering techniques\n- Understand fundamental AI/ML concepts\n- Familiar with AI features in primary design tools\n- Basic HTML/CSS knowledge for evaluating generated code\n- Understanding of AI ethics and responsible design principles\n\n## **Portfolio Updates**\n\n- At least one case study showing AI-enhanced design process\n- Documentation of how AI tools were used and what judgment was applied\n- If applicable, case study of designing AI-powered features\n- Personal project demonstrating AI tool capabilities\n\n## **Interview Preparation**\n\n- Can articulate specific examples of using AI in design work\n- Have nuanced perspective on AI capabilities and limitations\n- Ready to discuss ethical considerations of AI in design\n- Can answer 'How do you think AI will change design?'\n- Researched target companies' use of AI\n\n## **Ongoing Development**\n\n- Set up regular learning time for AI tool experimentation\n- Following AI/UX thought leaders and communities\n- Sharing learnings with peers or through writing\n- Tracking AI tool developments and new capabilities\n"
    }
  ]
}
